[
  {
    "Name": "Animate Junk Golem",
    "Description": "At the start of combat, the [name] summons a Junk Golem in range 3.",
    "Summons": {
      "Name": "Junk Golem",
      "Tags": [ "Size 1", "intangible" ],
      "SummonActions": "When summoned, or once on the [name]'s turn, the golem can move 3 spaces, then shove an adjacent foe 1. If that foe collides, they take 2 piercing damage and are vulnerable.",
      "SummonEffects": "When the golem enters the space of a valuables token, it absorbs it. It's speed, shove, and collide damage all increase by +1 for the rest of combat."
    }
  },
  {
    "Name": "Arkentech Hover Chair",
    "Description": "Flying and Sturdy. Loses both when bloodied."
  },
  {
    "Name": "Assets",
    "Description": "The [name] has a d6 power die, starting at 6. They may tick the die down to spend some of their tremendous wealth to empower their abilities. The die ticks up by 1 at the start of their turn, or 2 every time they pick up a valuables token."
  },
  {
    "Name": "Aura of Taxes",
    "Description": "Aura 2. Foes that enter or exit the aura stop moving and become immobile until the end of the current turn. They can ignore this effect by immediately paying 1 valuables token to the [name], which the Tollkin picks up. If they have paid the toll, they ignore this trait for the rest of combat."
  },
  {
    "Name": "Aura of Wealth",
    "Description": "Aura 2. All characters inside count as holding 1 valuables token"
  },
  {
    "Name": "Bully",
    "Description": "This character always treats bloodied foes as if they have a valuables token."
  },
  {
    "Name": "Cut and Run",
    "Description": "If a Scavenger has 4 or more valuables tokens, they attempt to flee the battlefield, fleeing successfully if they start their turn in an edge space of the battlefield with no hostile characters adjacent."
  },
  {
    "Name": "Deep Pockets",
    "Description": "Starts with 1 valuables token."
  },
  {
    "Name": "Golden Burden",
    "Description": "Has evasion against characters holding a valuables token."
  },
  {
    "Name": "Great Junk Armor",
    "Description": "The first and second time this character is damaged by an ability in a combat, reduce all damage to 0 and summon a valuables token in spaces in range 2 from them."
  },
  {
    "Name": "Greed",
    "Description": "When the Scavenger uses an ability and either they or their target has one or more valuables tokens, the ability gains more powerful greed effects."
  },
  {
    "Name": "Guard Loot",
    "Description": "Doesn't pick up valuables tokens. Instead, counts as holding any valuables tokens it is standing on, and has resistance while standing on at least one."
  },
  {
    "Name": "Junk Armor",
    "Description": "The first time the [name] is damaged by an attack or ability in a combat, reduce all damage to 0 and summon 1 valuables token in free space in range 2 from them."
  },
  {
    "Name": "Leave Tracks",
    "Description": "At the start of their turn, the [name] puts down a track in their space. A character that enters that space collects the track. When a track has been collected, the [name]'s Master Cloak trait deactivates until the end of the [name]'s next turn."
  },
  {
    "Name": "Loot Hauler",
    "Description": "[name]s can pick up valuables tokens. Allies of [name]s can take valuables tokens from them by entering or exiting a space adjacent to the [name] holding one."
  },
  {
    "Name": "Master Cloak",
    "Description": "While this trait is active, the [name] is unstoppable, has phasing, and cannot be directly targeted at all. Their location is not revealed on the map. Instead, the GM secretly records their location. Auras, area effects, and other effects that can target a space affect them normally (taking into account dodge). This trait deactivates until the end of the [name]'s next turn if a track is collected or the [name] attacks."
  },
  {
    "Name": "Oooh, Shiny",
    "Description": "When [name] enters the space of a valuables token, they stop moving and admire it, then pick it up. This stops any movement from any ability or round action and immediately halts the ability."
  },
  {
    "Name": "Tally",
    "Description": "The [name] has a d10 power die and Aura 2. Whenever a foe uses an attack against the [name] or any of its allies in the aura, tick the die up by 1. Also tick Tally up by 1 every time the Aurelian picks up a valuables token. Certain actions require higher or lower tally."
  },
  {
    "Name": "Thiefcraft",
    "Description": "Gains stealth at the start and end of their turn if holding a valuables token."
  },
  {
    "Name": "Tithe-law",
    "Description": "Characters can always avoid effects from the [name] by paying the [name] 1 valuables token, or sacrificing 25% of their max hp."
  }
]