[
  {
    "Name": "Acid Rain",
    "Description": "At the start of combat, the priest creates a blast 1 terrain effect in range 6. Characters that end their turn inside the terrain effect take piercing damage equal to the round number +2. The scion can redirect the terrain effect to any other point in range 6 as an action."
  },
  {
    "Name": "Beastmaster",
    "Description": "The Wrangler starts combat with 3 trained beasts. Place them within range 3. Each beast has a different ability (detailed in the Sic action)."
  },
  {
    "Name": "Blightbellow",
    "Description": "While bloodied, this character' areas of effect increase by +1, including active areas."
  },
  {
    "Name": "Blightlands Brawn",
    "Description": "When bloodied, becomes sturdy, Kidnap has no recharge, and goes +2 more spaces. (Can't be stunned or dazed, and reduce the distance of all shoves by 1)"
  },
  {
    "Name": "Call Ruin",
    "Description": "At the start of the round, the Ruin speaker chooses a space in range 6, that becomes known to all characters. At the end of the round, a ruin chunk surfaces in that space, a height 3 object. Spaces next to this terrain are difficult terrain. Any character occupying the space is pushed up on top of the ruin chunk but also takes 3[D]+[fray] and is stunned."
  },
  {
    "Name": "Great Kidnap",
    "Description": "The Slab can spend 2 actions on Kidnap to increase its distance to 6 spaces."
  },
  {
    "Name": "Harden",
    "Description": "The Clot hardens over time, and increases all damage it deals by an amount equal to twice the round number. At the end of round 6, it finally petrifies and is defeated."
  },
  {
    "Name": "Lowlander Toxin",
    "Description": "All attacks by lowlanders gain on hit: inflict lowlander toxin. A character afflicted by lowlander toxin loses 2 hp at the end of their turn, ignoring resistance, armor, and vigor. This effect cannot be removed in any way, only ends when combat ends or the character is defeated, and cannot reduce a character past 1 hp. Does not stack."
  },
  {
    "Name": "Master of the Underway",
    "Description": "This character gains stealth if they start or end their turn in a pit and can use their standard move or 1 action to teleport from any pit space to any other pit space."
  },
  {
    "Name": "Master of the Underway (Improved)",
    "Description": "This character gains stealth if they start or end their turn in a pit and as a free action they can teleport from any pit space to any other pit space."
  },
  {
    "Name": "Mud Body",
    "Description": "Has resistance while inside difficult or dangerous terrain, or pits. If outside those terrain areas, takes bonus damage and +1 curse on attacks and saves."
  },
  {
    "Name": "Rusty Blade",
    "Description": "When this character teleports to a pit space, they can then throw a knife at any foe in range 3, dealing 2 damage."
  },
  {
    "Name": "Suddenly!",
    "Description": "At the start of any round, the GM can spring a lowlander trap in any unoccupied space not adjacent to a player character. The trap is a pit with one of the following effects:\n• Snare trap - A character in range 2 of the trap must save or be shoved until inside the trap.\n• Stake trap - Trap is also dangerous terrain.\n• Poison trap - Characters that end their turn in the trap are poisoned and inflicted with lowlander toxin.\nAll traps can be disarmed by a character taking the interact action adjacent, removing it. Lowlanders and any of their allies are not affected by their own traps, or their effects, and can move over them normally. Traps remain even if deactivated."
  },
  {
    "Name": "Toxic Revenge",
    "Description": "Area Effect: When defeated, explodes with venom, inflicting [D]+[fray], poisoning and inflicting lowlander toxin on all adjacent foes."
  }
]