[
  {
    "Name": "Malice",
    "Description": "After they attack, the [name] marks their target, granting a stack of malice.",
    "ListedItems": [
      { "Description": "Malice stacks indefinitely and can mark any number of characters." },
      { "Description": "At the end of their turn, a character sacrifices 3 for every stack of Malice they have." },
      { "Description": "If a character suffering from Malice doesn't attack during their turn, at the end of their turn, they reduce their stacks of Malice by 2 before sacrificing, which could clear them." },
      { "Description": "It can also be cleared by anything that clears a mark, but doing so only clears one at a time." }
    ]
  },
  {
    "Name": "Beyond Death",
    "Description": "When defiance activates, roll a d6. On a 3+, this character immediately regains defiance. Divine damage bypasses this trait."
  },
  {
    "Name": "Spectral Form",
    "Description": "Gains phasing, flying, and speed 6."
  },

  
  {
    "Name": "Utterances of the Crawling Dead",
    "Description": "At the start of the round, the [name] begins incanting. It chooses a foe, who gains aura 2, and becomes immune to being shoved by the [name]'s abilities. Every other part of the battlefield begins to shift with crawling darkness. At the end of the round, the battlefield erupts. All foes not in the safe zone marked by the aura must sacrifice 50% of their maximum hp. If any of a character's soul fragments are not in the safe zone, they must additionally sacrifice 25% of their max hp per soul fragment caught outside the area."
  },


  {
    "Name": "Triumvirate",
    "Description": "This Legend is made up of three powerful undead lords. Each is a unique character and tracks statuses and effects separately, but all three share the same health pool and become bloodied when their total health is at 50%. When reduced to 0 hp, all three are defeated simultaneously."
  },
  {
    "Name": "Imperium",
    "Description": "When this legend takes a turn, it acts with one of the three Lords. It cannot take another turn with a Lord in a round until all three have acted. However, abilities with an Imperium effect grant the two lords who are not currently acting an additional effect."
  }
]