[
  {
    "Name": "Amorphous Limb Demon",
    "DisplayName": "Amorphous",
    "Description": "Can share space with other characters and objects. Any foes that end their turn inside its space take 2 damage. Does not provide obstruction, but characters treat its space as difficult terrain. Area effects this character creates can overlap its space, and it is immune to damage and effects from its own attacks."
  },
  {
    "Name": "Crawling Chaos",
    "Description": "When the Demon hits with an attack or uses certain abilities, it summons a crawling mass of loose limbs in a free space in range 3 of its location. The mass counts as a pit and dangerous terrain to all characters but the demon. A character can destroy a crawling mass by spending the interact action while adjacent to it."
  },
  {
    "Name": "A Thousand Hands",
    "Description": "The demon deals +1 base damage with its amorphous trait and all its abilities per crawling mass it is sharing space with."
  },

  
  {
    "Name": "Soul Suffering",
    "Description": "The violence demon can stack any number of marks on foes."
  },
  {
    "Name": "Blade of Agony",
    "Description": "Many actions from this legend summon a blade of agony, an incredibly sharp, bonelike demon blade. Blades can be summoned in range 3 from the demon.",
    "Summons": {
      "Name": "Blade of Agony",
      "Tags": [ "Size 1", "summon" ],
      "SummonEffects": "Foes may pass through the space of a blade, but treat them as difficult terrain. It also has the following effects.",
      "ListedItems": [
        {
          "Name": "Blade Slash",
          "Description": "Whenever a blade is summoned, all blades, including the one that was just summoned, slash every space adjacent to them, dealing 1 divine damage to all foes. A character can hit by multiple blades at once."
        },
        {
          "Name": "Blade Consume X",
          "Description": "Certain actions must consume X blades of agony to be used. Blades are consumed at the start of the action and must be in range 3 of the demon to be valid. This destroys the blades, removing them from the battlefield."
        }
      ]
    }
  },
  {
    "Name": "Regard",
    "Description": "Critically hitting the demon earns its regard until the end of the round, giving the demon hatred+ of that character for the duration. This effect can switch targets if the demon is critically hit again."
  },


  {
    "Name": "Court of the Covenant",
    "Description": "At the start of combat, or as a round action, the Majesty Demon summons until it has the following set of summons active: The Sycophant, the Scepter Bearer, the Shrouded Lady, the Maiden, and one Flagellant Knight per character. All summons are demons that must be placed within range 2 of a player character or the Majesty Demon and cannot be placed within range 2 of each other. Unlike other summons, some can be attacked and take damage, and are removed when defeated. The Majesty demon cannot directly target its summons with attacks and effects unless specified. When the Majesty Demon re-summons one of these special summons, it takes damage equal to twice their maximum hp, which cannot be reduced in any way.",
    "Summons": [
      {
        "Name": "The Sycophant", 
        "Tags": [ "Summon", "5 hp", "intangible" ],
        "SummonEffects": "Counts as an ally for player abilities. Projects aura 2 around it. The aura reduces all damage to to player characters to 1 while it is inside. At the end of any turn in which the aura was used to reduce damage, the Sycophant is destroyed."
      },
      {
        "Name": "The Scepter Bearer", 
        "Tags": [ "Summon", "5 defense", "10 hp", "flying" ],
        "SummonEffects": "When defeated, drops its scepter in its space as a terrain effect. Any character standing in the scepter space other than the Majesty Demon deals double damage with abilities (double all damage after rolling and totaling up all damage). The scepter disappears when this summon is re-summoned.",
        "SummonActions": "When summoned, and on each of the Majesty Demon's turns, flies 1. Cannot move unless it's within range 4 of a player character."
      },
      {
        "Name": "The Shrouded Lady", 
        "Tags": [ "Size 1", "Defense 5", "Flying" ],
        "SummonEffects": "At the end of the round, deals 40 damage to all adjacent characters other than the Majesty Demon.",
        "SummonActions": "Teleports 4 spaces when summoned, and at the start of each round towards the closest player character."
      },
      {
        "Name": "The Maiden", 
        "Tags": [ "Summon", "5 defense", "10 hp" ],
        "SummonEffects": "Has aura 2. Characters other than the Maiden in the aura are pacified+, but have resistance."
      },
      {
        "Name": "Flagellant Knight", 
        "Tags": [ "Summon", "5 defense", "40 hp" ],
        "SummonEffects": "When any character takes damage adjacent to the knight that wasn't dealt by a knight, the knight reduces it by 5, as if by armor, then takes 5 damage.",
        "SummonActions": "Once a round on the demon's turn, one flagellant knight may rush 2 towards the nearest foe and and use the following ability on them:",
        "Actions": {
          "Name": "Wicked Blade",
          "ActionCost": 0,
          "Hit": "6 damage.",
          "Miss": "2 damage.",
          "Effects": "Shove 2."
        }
      }
    ]
  }
]