{
  "Name": "Nocturnal",
  "Inherits": "Legend",
  "Type": "Foe",
  "UsesTemplate": true,
  "Traits": [ "Skirmisher", "Pick Off", "Master of the Night" ],
  "Actions": [
    {
      "Name": "Crippling Paranoia",
      "RoundAction": true,
      "Description": "At the start of the round, the [name] chooses a foe. At the end of the round, that foe deals 6 damage to all allies in adjacent spaces and dazes them, then the [name] can shove them 1 in any direction."
    },
    {
      "Name": "The Pain",
      "ActionCost": 1,
      "Tags": [ "attack", "range 3", "true strike" ],
      "PreEffect": "Teleport 1.",
      "Hit": "[D]+[fray] and shove 1.",
      "Miss": "[fray].",
      "Effects": "Teleport 1.",
      "Combo": {
        "Name": "The Agony",
        "ActionCost": 1,
        "Tags": [ "attack", "range 5" ],
        "Hit": "3 piercing damage, three times.",
        "Miss": "3 piercing damage once.",
        "Combo": {
          "Name": "The Horror",
          "ActionCost": 2,
          "Tags": [ "attack" ],
          "Hit": "2[D]+[fray].",
          "Miss": "[D]+[fray].",
          "Effects": "Deals 2 damage again to the target for each that is true: bloodied, blinded, dazed."
        }
      }
    },
    {
      "Name": "Bloody Slash",
      "ActionCost": 1,
      "Tags": [ "line 4" ],
      "AreaEffect": "Foes in the area take 2 damage once for every foe in the line, up to three times. The [name] may teleport to any space in the area after this ability resolves."
    },
    {
      "Name": "Great Fell Shot",
      "ActionCost": 1,
      "Tags": [ "range 4", "2/round" ],
      "Description": "Choose two free spaces in range. Characters that enter that space or start their turn there are struck by a projectile, taking 3 piercing damage twice, and ending this effect. This area lasts until triggered."
    }
  ],
  "PhasesDescription": "Phase change triggers at the start of each round. The [name] starts in phase I and goes up to phase II, then III, then back to I.",
  "Phases": [
    {
      "Actions": [
        {
          "Name": "Lost and Alone",
          "ActionCost": 1,
          "Tags": [ "range 3", "2/round" ],
          "Description": "The [name] swaps the places of two foes in range 3 of the [name] and each other, removing and placing them. One foe is then dazed."
        },
        {
          "Name": "Assassinate",
          "ActionCost": 1,
          "Tags": [ "range 3", "1/round" ],
          "Description": "The [name] chooses a foe in range 3 that has not acted yet this round. At the end of that foe's turn, as long as they're in range 3, teleport to any space adjacent to them, deal 2 damage, three times to them, and blind them. Reduce this damage to just 2 damage if they have an adjacent ally. Then, fly 1."
        }
      ]
    },
    {
      "Actions": {
        "Name": "Amygdala",
        "ActionCost": 1,
        "Tags": [ "range 2", "2/round" ],
        "Description": "All foes in range are inflicted with supernatural fear. They must save or be shoved 3 spaces in a direction of the [name]'s choice, or 1 space on a successful save."
      }
    },
    {
      "Actions": [
        {
          "Name": "Bloody Nightmare",
          "RoundAction": true,
          "Description": "At the start of the round, the [name] supernaturally slashes all foes. For the rest of combat, all foes take 2 piercing damage at the start of their turns. This effect stacks."
        },
        {
          "Name": "Kidnap",
          "ActionCost": 1,
          "Tags": [ "2/round" ],
          "Description": "The [name] dashes 4. A foe adjacent to any point during its dash is removed from the battlefield, then placed adjacent when it finishes its movement. Foes can save to avoid this effect, but are dazed on a successful save."
        }
      ]
    }
  ],
  "Tactics": "The [name] is an evasive and slippery legend fight that is the most scary when foes are split up. It can use its suite of abilities to force them to do so, or use Crippling Paranoia when it wants to really isolate someone."
}