[
  {
    "Name": "Frothing Mad",
    "Description": "Attacks gain +1 boon and can critically hit (+[D])."
  },


  {
    "Name": "Pick Off",
    "Description": "Attacks gain +1 boon against and can critical hit (+[D]) against foes with no allies adjacent."
  },
  {
    "Name": "Master of the Night",
    "Description": "The [name] has aura 2. It has evasion and gains stealth if there are no other characters in the aura."
  },
  

  {
    "Name": "The Horde",
    "Description": "The [name] starts combat with a unique Minions mob. Minions can be placed anywhere not in range 2 of a player. The Minions mob is defeated if the [name] is defeated.",
    "Summons": {
      "Name": "Minions",
      "Class": "Mob",
      "Traits": "Mob",
      "Tags": [ "4 Members/player", "Size 1", "Hits 2", "Speed 4 (Dash 2)", "Defense 8", "[D] d6", "Fray 3" ],
      "Description": "This mob takes one turn a round, at the end of the round after all other characters have acted.",
      "Actions": [
        {
          "Name": "Press the Assault",
          "ActionCost": 1,
          "Tags": "attack",
          "Hit": "[D]+[fray].",
          "Miss": "[fray] damage.",
          "Effects": "Up to four other minions can dash 2. Then, any foes adjacent to at least one minion that dashed this way take 2 piercing damage."
        },
        {
          "Name": "Guardian Stance",
          "ActionCost": 1,
          "Tags": "stance",
          "Description": "Up to four minions take a defensive stance until the start of the mob's next turn. For the duration, if the master is targeted by an ability and is adjacent to one of these minions, the minion can sacrifice themself as an interrupt, destroying them, to grant the master resistance to that ability and +1 boon on any saves. The mob can take this interrupt any number of times a round, but only once a turn."
        },
        {
          "Name": "Skewering Wall",
          "ActionCost": 1,
          "Tags": "stance",
          "Description": "Up to four minions take an aggressive stance until the start of the mob's next turn. For the duration, any foe that starts or ends their turn adjacent to one of these minions takes 2 piercing damage and is shoved 1."
        }
      ]
    }
  },


  {
    "Name": "Radiance",
    "Description": "When this phase triggers, remove the [name] from the battlefield, then place them in the center of the battlefield, or as close as possible. The [name] is immobile during this phase but its abilities have no maximum range. All characters not in cover from the [name] take 4 piercing damage at the end of their turn."
  }
]