{
  "Name": "Thannir",
  "Inherits": [ "Jotunn", "Leader" ],
  "Type": "Foe",
  "Chapter": 2,
  "RemoveTraits": "Titanblood",
  "Traits": "Size 2",
  "Actions": [
    {
      "Name": "Spirit Scythe",
      "ActionCost": 1,
      "Tags": [ "attack", "arc 6" ],
      "AutoHit": "[fray].",
      "AreaEffect": "[fray].",
      "Effects": "Attack target is sealed and shoved 1 in any direction."
    },
    {
      "Name": "Lonely Dead",
      "ActionCost": 1,
      "Description": "The Thannir summons a lonely soul in range 4.",
      "Summons": {
        "Name": "Lonely Soul",
        "Tags": [ "Summon", "Size 1" ],
        "SummonActions": "When summoned, or once a round on the [name]'s turn thereafter, may move 3 spaces and deal 2 piercing damage to an adjacent foe. If that foe is sealed or marked, the soul can also then shove the foe 1."
      }
    },
    {
      "Name": "Full Bloom",
      "ActionCost": 1,
      "Tags": [ "range 6", "small blast" ],
      "AreaEffect": "2 piercing damage. If a foe is sealed, it takes 2 piercing damage again. If a foe is also marked, it takes 2 piercing damage once more."
    },
    {
      "Name": "Rune of the Spring Flower",
      "ActionCost": 1,
      "Tags": [ "range 6", "multimark" ],
      "Description": "The [name] marks itself or an ally in range. After any ability that damages that ally resolves, they gain 2 vigor and may dash 2."
    },
    {
      "Name": "Rune of the Grave",
      "ActionCost": 1,
      "Tags": [ "range 6", "mark" ],
      "Description": "A foe in range 6 must save or be marked. On a successful save, they are pacified instead. While marked, a character cannot benefit from defiance or effects that prevent them from being defeated, loses all vigor at the end of each turn, and cannot gain vigor. A character can end this mark by spending an entire turn not attacking."
    },
    {
      "Name": "Execute",
      "ActionCost": 2,
      "Description": "A foe in range 2 at 25% HP or lower must save. On a failed save, they are defeated, ignoring all other effects. On a successful save, they are reduced to 1 hp."
    }
  ]
}