[
  {
    "Name": "Arkentech Munitions",
    "Tags": [ "summon", "start of round" ],
    "Description": "At the start of each round, the Weapon summons two Arkentech munitions, massive explosives.\n- Munitions are size 1 immobile summons with 1 hp that are automatically hit by attacks. They can be shoved or teleported.\n- A character can pick up a munition by passing through its space, and drop it as a free action. It shares their space and moves or teleports with them as long as they're holding it. If they take damage while holding a munition, it explodes.\n- When damaged, a munition explodes in a blast 2 area effect. Characters inside are dazed, then must save or take 2[D]+[fray] and become burning, or [fray] on a successful save.\n- If the munition catches the Weapon in its area of effect, it strips off an armor plate instead of dealing damage normally. If there are no armor plates remaining, it deals damage normally.\n- The Weapon can't target munitions unless it also targets a player character or summon with the same action."
  },
  {
    "Name": "Arkentech Armor Plate",
    "Description": "The weapon has four of these plates, which can only be blown off by explosions from Arkentech munitions. When a plate is blown off, the weapon's body takes double damage from all sources until the end of the current round. When all plates are blown off, this effect is permanent."
  },

  {
    "Name": "Advanced Scopes",
    "Description": "Immune to blinded."
  },
  {
    "Name": "Arkentech Artillery",
    "Description": "At the start of combat, divide the map into four equal size quadrants, then number each one. At the start of each round, the Weapon shoots an artillery barrage into the start of the air that comes down, affecting all foes in one of the quadrants. Roll 1d4 to check which quadrant it starts in in round 1, then it moves clockwise at the start of each subsequent round. Characters in the chosen quadrant at the end of the round must save or take 2[D]+[fray] piercing damage, or [D]+[fray] on a successful save. Then create two size 1 debris objects in the area."
  },
  {
    "Name": "Landship",
    "Description": "During Phase I, the weapon is immobile, cannot be shoved or teleported, and does not occupy space normally. Instead, it occupies 1 space just outside the edge of one side of the battlefield (imagine it lined up along the edge). Run the weapon on a battlefield that is relatively small (10x10 or smaller). If it is removed from the battlefield, it returns in the same spot."
  },
  
  {
    "Name": "Airship",
    "Description": "This Veridian Weapon fight takes place on the Veridian Weapon, an airship that could be any shape, but is better run on a smaller, rectangular map of no more than 10 or 12 spaces on its longest side. The deck of the airship is treated as terrain and not a character (it's too heavily armored), but its three sections (see below) can be attacked to deal damage to it."
  },
  {
    "Name": "Arkentech Megabomb",
    "Description": "The Weapon has a massive Arkentech energy bomb that is constantly charging. If it is allowed to fire it, it ends the fight, resulting in a player loss. Usually the weapon firing will result in some massive loss of life, like a town being wiped out, but you can decide what the stakes are for your game.\nTrack the bomb's energy charge with a d6. It ticks up 1 at the start of each round. If the Veridian Weapon ends a round with its charge at 6 or higher, the fight is over. Players can deplete the charge by destroying sections, and the weapon can increase it by summoning Overlock Pistons (see below)."
  },
  {
    "Name": "Sections Veridian Weapon",
    "DisplayName": "Sections",
    "Description": "The targetable parts of the Weapon are three separate sections: the Engine, the Forward Turret, and the Aft Turret.\n- Each section is a size 2 character that is immobile, immune to shove and teleport, and has 1/3 of the Weapon's total HP. If removed from the battlefield, it can only be placed in the same space.\n- Sections cannot be placed within range 2 of each other.\n- The Sections also count as height 2 objects. Other characters can move on them or use them as cover.\n- Each track statuses and damage separately.\n- When acting, the Weapon acts using the profile of only one of its section at a time.\n- When a section is reduced to 0 hp, it is destroyed. When all three are destroyed, the Weapon is defeated. When a section is destroyed, it no longer counts as terrain or provides cover.\n- Each section must act at least once in a round before any other section can take a turn."
  },
  {
    "Name": "Under-deck Rumbling",
    "Description": "At the start of the round, the Engine creates a blast 1 area in range 6. At the end of the round, the area explodes. Characters still standing in the area take [D]+[fray] and are shoved 2 away from the center."
  },
  {
    "Name": "Anti-boarder Napalm Flood",
    "Description": "At the end of the round, all non automata characters not standing on an object height 1 or higher takes [fray] damage."
  },
  {
    "Name": "Destruction Airship Engine",
    "DisplayName": "Destruction",
    "Description": "If this section is destroyed, all remaining sections gain Lurch as a 1/round free action."
  },
  {
    "Name": "Destruction Forward Turret",
    "DisplayName": "Destruction",
    "Description": "If this section is destroyed, all remaining sections gain Tracking Missile as a 1/round free action."
  },
  {
    "Name": "Destruction Aft Turret",
    "DisplayName": "Destruction",
    "Description": "If this section is destroyed, remaining sections gain the ability to summon Combat Automata as a 1/round free action."
  }
]