[
  {
    "Name": "Hellforged",
    "Description": "Immune to its own terrain effects."
  },

  
  {
    "Name": "Advanced Scopes",
    "Description": "Immune to blinded, and abilities have no maximum range."
  },
  {
    "Name": "Landship",
    "Description": "The weapon is immobile. It occupies 1 space along the entire edge of one side of the battlefield (imagine it lined up along the edge). Characters and objects cannot share space with the weapon. If it is removed from the battlefield, it always returns in the same spot."
  },

  
  {
    "Name": "Airship",
    "Description": "This Weapon fight takes place on the Weapon, an airship that could be any shape, but is better run on a smaller, rectangular map of no more than 10 or 12 spaces on its longest side. The deck of the airship is treated as basic terrain and not a character (it's too heavily armored), but its three sections can be attacked to deal damage to it."
  },
  {
    "Name": "Arkentech Megabomb",
    "Description": "The Weapon has a massive Arkentech weapon that is constantly charging. If it is allowed to fire it, it ends the fight, resulting in a player loss. Usually the weapon firing will result in some massive loss of life, like a town being wiped out, but you can decide what the stakes are for your game.\nTrack the bomb's energy charge with a d6. It starts at 1, and ticks up by 1 at the start of each round past the first. If the Veridian Weapon ends a round with its charge at 6 or higher, the fight is over. Players can deplete the charge by destroying sections, and the weapon can increase it with certain abilities."
  },
  {
    "Name": "Section Rules Veridian Weapon",
    "DisplayName": "Section Rules",
    "Description": "The targetable parts of the Weapon are three separate sections: the Engine, the Forward Turret, and the Aft Turret.",
    "ListedItems": [
      { "Description": "Each section is a separate size 2 character that is immobile and has 1/3 of the Weapon's total HP. If removed from the battlefield, can only be placed in the same space." },
      { "Description": "Sections cannot be placed within range 2 of each other." },
      { "Description": "The Sections also count as height 2 objects. Other characters can move on them or use them as cover." },
      { "Description": "When acting, the Weapon acts with only one of its sections at a time. It must take a turn with each of its sections in a round before taking a turn with a different section." },
      { "Description": "When a section is reduced to 0 hp, it is destroyed and removed from the battlefield." },
      { "Description": "When all three are destroyed, the Weapon is defeated." }
    ]
  },
  {
    "Name": "Automata Veridian Weapon",
    "DisplayName": "Automata",
    "Description": "Sections can summon Automata. Automata are summons without intangible, so they can be attacked and damaged regularly. They otherwise abide by the regular summon rules. Automata have a defense of 5 and 5 hp. When created, they can be created in any free space in range 4 of the section that created them."
  },
  {
    "Name": "Destruction Airship Engine",
    "DisplayName": "Destruction",
    "Description": "If this section is destroyed, all remaining sections gain Lurch as a 1/round free action."
  },
  {
    "Name": "Destruction Forward Turret",
    "DisplayName": "Destruction",
    "Description": "If this section is destroyed, all remaining sections gain Collateral Damage as a 1/round free action."
  },
  {
    "Name": "Destruction Aft Turret",
    "DisplayName": "Destruction",
    "Description": "If this section is destroyed, remaining sections gain the ability to summon Combat Automaton as a 1/round free action."
  }
]