[
  {
    "Name": "Acid Burst",
    "Description": "When this character takes damage, all adjacent foes take 1 piercing damage. Increase this damage to 2 piercing against poisoned characters. This effect can trigger any number of times a round."
  },
  {
    "Name": "Acid Splash",
    "Description": "Attacks deal 1 piercing damage on hit or miss to all foes in range 2 of the target as an area effect."
  },
  {
    "Name": "Acrobatics",
    "Actions": [
      {
        "Name": "Acrobatics",
        "ActionCost": 0,
        "Description": "Dash 2. This action can interrupt and split up other actions or movement."
      }
    ]
  },
  {
    "Name": "Aerial Acrobat",
    "Description": "If an attack misses the [name], they may deal 2 damage to the attacker, then fly 2."
  },
  {
    "Name": "Aetherflesh",
    "Description": "The [name] can teleport 5 instead of taking a standard move."
  },
  {
    "Name": "Aetherskin",
    "Description": "When bloodied, becomes intangible until the end of its next turn."
  },
  {
    "Name": "Aetherwall",
    "Description": "Gains resistance against all abilities from characters that are outside of range 2 from them (Resistance halves damage)."
  },
  {
    "Name": "All Terrain Vehicle",
    "Description": "Unaffected by terrain and height movement penalties."
  },
  {
    "Name": "Amorous Waltz",
    "Description": "Immune to all damage from pacified foes."
  },
  {
    "Name": "Amorphous",
    "Description": "Can share space with other characters. Any characters that start their turn inside its space take [fray] damage."
  },
  {
    "Name": "Arkentech Bike",
    "Description": "The [name] ignores difficult terrain. It can only move in straight lines, but has phasing. Any character it passes through takes 2 damage, but no more than once a turn."
  },
  {
    "Name": "Armor [X]",
    "Description": "Reduce all damage taken by [X]."
  },
  {
    "Name": "Aura of Bloodlust",
    "Description": "Aura 1. Foes that end their turn in the Aura must save or gain hatred of this character."
  },
  {
    "Name": "Aura of Distortion",
    "Description": "Aura 1. Allies inside the aura have evasion and foes are blinded+. Becomes aura 2 when bloodied."
  },
  {
    "Name": "Aura of Dread",
    "Description": "The [name] has aura 2. Foes inside the aura take +1 curse on saves. Any foe that fails a save inside the area must sacrifice 3."
  },
  {
    "Name": "Aura of Freedom",
    "Description": "Aura 1. The [name] and allies in the aura are immune to movement penalties from terrain and elevation."
  },
  {
    "Name": "Aura of Glamour",
    "Description": "Aura 2. Foes outside the aura cannot directly target this character with abilities."
  },
  {
    "Name": "Aura of Immortality",
    "Description": "While the [name] is undefeated, it has Aura 2. Allies without this trait inside cannot be reduced past 1 HP."
  },
  {
    "Name": "Aura of Resilience",
    "Description": "Aura 2. Self and allies in the aura gain +1 boon on saves and are immune to critical hits. (downgrade critical hits to regular hits)"
  },
  {
    "Name": "Aura of Rot",
    "Description": "Aura 2. Foes that start or end their turn in the aura lose all vigor, then take 2 piercing damage."
  },
  {
    "Name": "Aura of Shielding",
    "Description": "Aura 1. Self and allies in the area have dodge."
  },
  {
    "Name": "Aura of Terror",
    "Description": "Aura 1. Foes that end their turn in the aura must save or become pacified and shoved 1."
  },
  {
    "Name": "Automata",
    "Description": "If the [name] attacks the same character as last turn, it deals bonus damage and gains +1 boon. This effect stacks."
  },
  {
    "Name": "Battle Platform",
    "Description": "Characters can mount or dismount the [name] by spending 1 space of movement, placing them adjacent when dismounting, with the following rules:",
    "ListedItems": [
      { "Description": "Allies can start the battle mounted on the [name]." },
      { "Description": "While mounted, place characters inside a free space in the [name] (so the [name] has space for 4 size 1 characters). They share its space, move when it moves, and have cover. While moving with the [name], characters are unstoppable." },
      { "Description": "Characters hostile to the [name] must pass a save to mount it." },
      { "Description": "Characters mounting it the [name] when it is defeated are placed in any free adjacent space of the [name]'s choice and take 3 damage." }
    ]
  },
  {
    "Name": "Blight Splash",
    "Description": "Attacks deal 1 piercing damage on hit or miss to all foes in range 2 of the target as an area effect."
  },
  {
    "Name": "Blood Hunger",
    "Description": "Deals +2 damage with all abilities against bloodied foes."
  },
  {
    "Name": "Blood Price",
    "Description": "The [name] has Aura 2:",
    "ListedItems": [
      { "Description": "Foes inside the aura that use an ability must sacrifice 2 after the ability resolves." },
      { "Description": "Whenever a character in the area sacrifices, the [name] may grant 2 vigor to itself or any ally in the aura." }
    ]
  },
  {
    "Name": "Blood Rush",
    "Description": "May rush 2 before making any attack. If the attack triggers exceed, may rush 2 again."
  },
  {
    "Name": "Blood Scent",
    "Description": "Always focuses on the closest bloody foe."
  },
  {
    "Name": "Bloodwhetter",
    "Description": "When this character is damaged by an ability they may deal 2 damage to an adjacent foe. This happens each time this character is damaged."
  },
  {
    "Name": "Boiling Shroud",
    "Description": "While bloodied, the [name] has permanent stealth and gains aura 1. All other characters inside the aura are blinded+ while inside."
  },
  {
    "Name": "Brace",
    "Description": "When adjacent to an object, increase the range of all abilities with a listed range by +4."
  },
  {
    "Name": "Bullheaded",
    "Description": "Has resistance unless suffering from a status."
  },
  {
    "Name": "Camouflage",
    "Description": "If this [name] ends its turn adjacent to an object or or inside difficult or dangerous terrain, it gains stealth."
  },
  {
    "Name": "Cheap Trick",
    "Description": "When missed by an attack, may deal 1 damage to their attacker, then teleport 1."
  },
  {
    "Name": "Commander's Aura",
    "Description": "Aura 2. Allies in the aura have +1 boon on attacks."
  },
  {
    "Name": "Cornered",
    "Description": "When half its members are remaining or less, this [name] gains +1 action."
  },
  {
    "Name": "Counter",
    "Description": "Each time a foe deals damage to you with an ability, deal 2 damage back."
  },
  {
    "Name": "Cowardly by Nature",
    "Description": "The [name] surrenders and ends the fight if it's the only character left."
  },
  {
    "Name": "Cronies",
    "Description": "This character starts combat with 5 mob allies, regardless of encounter budget."
  },
  {
    "Name": "Crumbling Body",
    "Description": "Each time it would take damage from an action or ability, permanently reduce its armor by 1 for the rest of combat, even if that damage is reduced to 0. If it's armor is 0, it becomes vulnerable+."
  },
  {
    "Name": "Crystal Dagger",
    "Description": "When the demon teleports, it may deal 1 damage to a foe in range 3."
  },
  {
    "Name": "Curl Up",
    "Description": "When defeated, this character curls up and becomes a height 1 boulder object."
  },
  {
    "Name": "Curse the Eyeless",
    "Description": "Evasion against blinded or slowed characters. (Roll a d6 when targeted by an attack. On a 4+, the attack automatically misses. Check before the attack roll)"
  },
  {
    "Name": "Dark Hollow",
    "Description": "Deals bonus damage and has evasion unless there's two or more adjacent characters."
  },
  {
    "Name": "Death Whistle",
    "Description": "When this character attacks, other characters in range 2 of it must save or lose any stances they are holding."
  },
  {
    "Name": "Defiance",
    "Description": "Prevents hit points from being reduced past 1 hp. When this triggers, remove this effect and character becomes immune to all damage for the rest of the current turn."
  },
  {
    "Name": "Deflate",
    "Description": "If the [name] is prevented from flying, it becomes immobile until it can fly again."
  },
  {
    "Name": "Dig",
    "Description": "Can phase through terrain and characters."
  },
  {
    "Name": "Diaga",
    "Actions": [
      {
        "Name": "Diaga",
        "ActionCost": 1,
        "Description": "An ally in range 4 is cured."
      }
    ]
  },
  {
    "Name": "Dirty Fighting",
    "Description": "+1 boon on attacks and bonus damage to characters inside pits."
  },
  {
    "Name": "Divine Presence",
    "Description": "Immune to stun."
  },
  {
    "Name": "Dodge",
    "Description": "Immune to damage from missed attacks, area effects, and successful saves."
  },
  {
    "Name": "Duty of Death",
    "Description": "Adjacent allies to this character without this trait have dodge."
  },
  {
    "Name": "Dweller in Dark",
    "Description": "The [name] has the following abilities:",
    "ListedItems": [
      {
        "Description": "Immune to blinded."
      },
      {
        "Description": "May use its standard move to teleport from the area of any pit to any other pit in range 4."
      },
      {
        "Description": "Has resistance while inside a pit."
      }
    ]
  },
  {
    "Name": "Ear Splitting Song",
    "Description": "The [name] has aura 2. Foes in the aura gain +1 curse on saves and do not save against statuses at the end of their turn. The aura increases to aura 3 when the [name] is bloodied."
  },
  {
    "Name": "Earth Bond",
    "Description": "Resistance when adjacent to an object or inside a pit."
  },
  {
    "Name": "Earthbreaker",
    "Description": "This character can phase through objects and destroys any objects it moves through this way. Objects that can't normally be destroyed are instead removed as if they were unsummoned."
  },
  {
    "Name": "Elite",
    "Description": "Takes 2 turns.",
    "EncounterBudget": 2
  },
  {
    "Name": "Empty Husk",
    "Description": "This character becomes a height 1 object when defeated instead of a character, and cannot be returned to the battlefield."
  },
  {
    "Name": "Enrage",
    "Description": "+1 action when bloodied."
  },
  {
    "Name": "Entrench",
    "Description": "Unstoppable while inside a pit. (Immune to all statuses. Can't be immobilized, shoved, or teleported by foes)"
  },
  {
    "Name": "Equivalent Exchange",
    "Description": "Aura 1. Once a round, when an ally in the Aura is defeated, deal divine damage to any foe on the battlefield equal to 25% of their max hp."
  },
  {
    "Name": "Eternal Rage",
    "Description": "When defeated, instead remain at 1 hp and become intangible until the end of their next turn. At the end of that turn, become defeated."
  },
  {
    "Name": "Ethereal",
    "Description": "Phasing, and has resistance unless adjacent to a foe."
  },
  {
    "Name": "Evasion",
    "Description": "Roll a d6 when targeted by an attack. On a 4+, the attack automatically misses. Check before the attack roll."
  },
  {
    "Name": "Explosive Demise",
    "Description": "When defeated, explodes in a small blast area effect centered on it. Characters inside are shoved 1 away from the origin space and must save or take [D]+[fray], or [fray] on a successful save."
  },
  {
    "Name": "Eyeless",
    "Description": "Immune to blinded."
  },
  {
    "Name": "Flip Over",
    "Description": "When taking damage more than its armor total, loses all armor, becomes stunned, and all attacks against it are critical hits. These effects last until the end of its next turn."
  },
  {
    "Name": "Flying",
    "Description": "Ignores terrain damage and movement penalties, height movement penalties, obstruction, and engagement."
  },
  {
    "Name": "Forced March",
    "Description": "At the start of their turn, the [name] and all allies may dash 1 in the same direction."
  },
  {
    "Name": "Fortify",
    "Description": "At the end of their turn, gains vigilance 1."
  },
  {
    "Name": "Frenzy",
    "Description": "When hitting with an attack, immediately gain +1 action."
  },
  {
    "Name": "Gran Diaga",
    "Description": "Aura 2. At the start of the [name]'s turn, all allies in the aura gain vigor 3."
  },
  {
    "Name": "Great Enrage",
    "Description": "Sturdy and +1 action while bloodied. (Can't be stunned or dazed, and reduce the distance of all shoves by 1)"
  },
  {
    "Name": "Greenwalker",
    "Description": "Immune to difficult terrain."
  },
  {
    "Name": "Grit",
    "Description": "Sturdy when bloodied. (Can't be stunned or dazed, and reduce the distance of all shoves by 1)"
  },
  {
    "Name": "Guard",
    "Description": "Has Rampart, Reduce all damage to self and allies in orthogonal spaces by 2, as if by armor."
  },
  {
    "Name": "Heavy Arkentech Armor",
    "Description": "The [name] is fitted with heavy power armor that is only strong from the front, with the following effects:",
    "ListedItems": [
      { "Description": "They cannot dash, fly, or teleport." },
      { "Description": "They can be used for cover by allies as if a height 1 object." },
      { "Description": "At the end of the [name]'s turn, decide which character they are facing towards. They become resistant to all damage from that character and unstoppable against any of their abilities. It can instead choose to grant these benefits to an adjacent ally. It must choose a different character each turn from the last." }
    ]
  },
  {
    "Name": "Heavy Armor",
    "Description": "Resistant to abilities used from adjacent spaces."
  },
  {
    "Name": "Heavy Caliber",
    "Description": "The [name]'s abilities have Collide: [fray] damage and foe is slashed."
  },
  {
    "Name": "Heavy Metal Shield",
    "Description": "Has resistance against abilities from the closest foe. If multiple foes are equidistant, this trait applies to all of them. (Take 1/2 damage, rounded up)"
  },
  {
    "Name": "Hellforged",
    "Description": "Immune to difficult and dangerous terrain."
  },
  {
    "Name": "Hold the Line",
    "Description": "If the [name] ends any turn without attacking, they gain Sturdy and Vigilance +1."
  },
  {
    "Name": "Hollow",
    "Description": "Aura 1. While there is exactly 1 other character in hollow's aura, it has have evasion and stealth. This aura has no effect if no other characters, or 2 or more other characters are inside, and its effects (including stealth) turn off it if deactivates."
  },
  {
    "Name": "Hovering",
    "Description": "Immune to rampart."
  },
  {
    "Name": "Immobile",
    "Description": "Can't move, be moved, or be removed from the battlefield in any way."
  },
  {
    "Name": "Immortal Disregard",
    "Description": "Attacks never miss the [name] (turn any miss into a hit).",
    "Defense": 0
  },
  {
    "Name": "Immovable Object",
    "Description": "Cannot be shoved, teleported, or removed from the battlefield."
  },
  {
    "Name": "Insulated",
    "Description": "Immune to damage from terrain and terrain effects."
  },
  {
    "Name": "Isolation",
    "Description": "Has resistance to damage dealt by characters with no allies adjacent. (Take 1/2 damage, rounded up)"
  },
  {
    "Name": "Juggernaut",
    "Actions": [
      {
        "Name": "Juggernaut",
        "RoundAction": true,
        "Description": "At the start of the round, this character may clear a status or mark."
      }
    ]
  },
  {
    "Name": "Latch",
    "Description": "Starts combat sharing the same space as another ally the same size or larger. While latched on, can't move, but instead moves with its host. Being moved out of its host's space end this effect. If the [name] would be shoved, teleported, or removed from the battlefield, it can pass a save to avoid the effect and become immune to these effects until the end of the current turn. Can latch on to a new adjacent allied character with 1 action or its standard move ability."
  },
  {
    "Name": "Lead Astray",
    "Description": "Aura 2. This character may teleport any other character that ends their turn in the aura 2 spaces in any direction."
  },
  {
    "Name": "Leap",
    "Description": "This [name] ignores height movement penalties. When it ends any movement on a lower elevation than it started, it gains flying for the duration of that movement."
  },
  {
    "Name": "Legend",
    "Description": "Takes 1 turn for each player character.",
    "EncounterBudget": -1.0
  },
  {
    "Name": "Living Lightning",
    "Description": "Electrifies foes it moves through. Foes that are already electrified must save or become slowed. Allied spaces cost 0 movement to pass through."
  },
  {
    "Name": "Living Root",
    "Description": "When defeated, becomes a height 2 object."
  },
  {
    "Name": "Living Statue",
    "Description": "Cannot dash. When defeated, becomes a height 2 piece of terrain.",
    "DashMultiplier": 0
  },
  {
    "Name": "Lone Wolf",
    "Description": "When ending their turn with no foes or allies in range 2, gains stealth."
  },
  {
    "Name": "Long Legs",
    "Description": "Ignores all obstruction and terrain movement penalties."
  },
  {
    "Name": "Low Profile",
    "Description": "Has evasion against ranged attacks."
  },
  {
    "Name": "Lucky Feather",
    "Description": "When taking damage that would reduce this character to 0 hp, roll 1d6. On a 3+, become immune to all damage from the triggering ability. True strike bypasses this effect."
  },
  {
    "Name": "Lumbering",
    "Description": "Cannot dash. Only takes slow turns.",
    "DashMultiplier": 0
  },
  {
    "Name": "Martyrdom",
    "Description": "When defeated, cures all allies in range 2."
  },
  {
    "Name": "Master of Gun",
    "Description": "Has counter against all abilities used from a range of 3 or greater. Damage from counter ignores cover."
  },
  {
    "Name": "Master of Strategy",
    "Description": "Before combat starts, may move every character to any space up to 2 spaces in any direction from their starting location."
  },
  {
    "Name": "Mob",
    "Description": "This character doesn't trigger slay effects, and is removed when defeated."
  },
  {
    "Name": "Monster Riding",
    "Description": "The [name] starts combat riding a trained monster, and can also mount it as an action or by spending its standard move. While riding, the [name] shares space with the monster and moves when it moves, becoming unstoppable while moving this way. If the two are separated, this effect ends until the monster is remounted.",
    "Summons": {
      "Name": "Tame Monster",
      "Tags": [ "Size 1 summon"],
      "SummonActions": "During the [name]'s turn, can dash 4, then either shove a character 1 space or deal 2 damage to them."
    }
  },
  {
    "Name": "Nimble",
    "Description": "Has evasion unless suffering from a status."
  },
  {
    "Name": "Noxious Censer",
    "Description": "The priest has Aura 2. Poisoned foes in the aura get +1 curse on attacks and saves."
  },
  {
    "Name": "Overwhelming Stench",
    "Description": "Aura 1. Attackers in the aura gain +1 curse on attacks, and any character that ends their turn in the aura must save or become slow and poisoned. Poisoned characters treat the area as dangerous terrain."
  },
  {
    "Name": "Pack Tactics",
    "Description": "Gains +1 boon on attacks if an ally is adjacent to their target."
  },
  {
    "Name": "Pack Tactics (Improved)",
    "DisplayName": "Pack Tactics",
    "Description": "Gains +1 boon on attacks if an ally is adjacent to their target and bonus damage for every ally adjacent to their target."
  },
  {
    "Name": "Painwrack",
    "Description": "Characters that collide with this character take [fray] damage."
  },
  {
    "Name": "Partner Work",
    "Description": "Aura 2. When this character dashes, an ally in the aura may also dash 1."
  },
  {
    "Name": "Phase Slip",
    "Description": "After being damaged for the first time on any turn, become intangible until the start of the following turn."
  },
  {
    "Name": "Phasing",
    "Description": "Can ignore obstruction and pass through, but not end your turn in, terrain, objects, or characters."
  },
  {
    "Name": "Pixie Dust",
    "Description": "Aura 2. Allies that start their turn in the aura gain flying until the end of their turn."
  },
  {
    "Name": "Primal Strength",
    "Description": "All the [name]'s abilities have Collide: foes are is weakened. Weakened foes take 2 damage on collide instead, and the [name] gains 2 vigor."
  },
  {
    "Name": "Rampart",
    "Description": "Foes cannot enter or exit a space affected by a rampart effect by dashing, flying, or teleporting."
  },
  {
    "Name": "Rancor",
    "Description": "Foes that end their turn adjacent to the [name] take 3 damage and are slashed."
  },
  {
    "Name": "Ranged Master",
    "Description": "Ignores ranged attack penalties for adjacent foes."
  },
  {
    "Name": "Regeneration",
    "Description": "If bloodied, gain 4 vigor at the end of your turn."
  },
  {
    "Name": "Regenerator",
    "Description": "Starts combat with vigor 1 and Regeneration. Starts combat bloodied. (Gain vigor 1 as the end of their turn)."
  },
  {
    "Name": "Resistance",
    "Description": "Take 1/2 damage, rounded up."
  },
  {
    "Name": "Rook",
    "Description": "Grants cover to adjacent allies."
  },
  {
    "Name": "Saddle Up",
    "Description": "An adjacent ally can mount or dismount this character as a free action, entering and sharing its space. Whiled mounted, attacks take +1 curse against a rider. Allies can start any combat already riding this character. This character has room for two size 1 characters. If this character is defeated, characters dismount."
  },
  {
    "Name": "Salty",
    "Description": "When the Sailor sacrifices any amount, they gain 3 vigor after the triggering ability resolves."
  },
  {
    "Name": "Shaggy Mass",
    "Description": "The [name] blocks line of sight and provides cover as though it was a height 3 object."
  },
  {
    "Name": "Shambling",
    "Description": "Cannot dash.",
    "DashMultiplier": 0
  },
  {
    "Name": "Shed Flesh",
    "Description": "After taking damage that bloodies it, becomes intangible until the start of its next turn as it wriggles out of its flesh. For the rest of combat, gains phasing and flying."
  },
  {
    "Name": "Shelter",
    "Description": "+1 boon on saves."
  },
  {
    "Name": "Size [X]",
    "Description": "This character takes up a [X] by [X] area of spaces."
  },
  {
    "Name": "Skirmisher",
    "Description": "Can move diagonally, and dash moves full speed.",
    "DashMultiplier": 1
  },
  {
    "Name": "Slam",
    "Description": "When a character collides from the [name]'s moves, they are slashed. Slashed characters take [fray] damage instead."
  },
  {
    "Name": "Slime Trail",
    "Description": "Aura 1. Any foe that starts their turn in the aura slips and is shoved 2. Collide: Foe takes [fray] damage."
  },
  {
    "Name": "Slimy Skin",
    "Description": "When damaged, may dash 1 as an effect."
  },
  {
    "Name": "Slip",
    "Description": "Movement ignores rampart, interrupts, and vigilance."
  },
  {
    "Name": "Slippery",
    "Description": "Has evasion while bloodied."
  },
  {
    "Name": "Sneak",
    "Description": "While in stealth, has evasion and phasing."
  },
  {
    "Name": "Sneak Attack",
    "Description": "Attacks that break Stealth deal bonus damage and can critical hit (+[D])."
  },
  {
    "Name": "Soul Mass",
    "Description": "Can share space with other characters. Foes treat the space as difficult terrain, are slashed+ while inside, and have cover from the outside, but are otherwise targetable normally. Any foes that start their turn inside its space take [fray] damage. Foes that attempt to leave the [name]'s space by any means on their turn must save or become unable to exit it until the end of the current turn."
  },
  {
    "Name": "Spindly Limbs",
    "Description": "Ignores engagement from other character, and spends no additional movement moving up or down terrain."
  },
  {
    "Name": "Spirit Shift",
    "Description": "This character is intangible and gains phasing while moving."
  },
  {
    "Name": "Spiritfeed",
    "Description": "All this character's abilities gain slay: gain +1 action."
  },
  {
    "Name": "Stench",
    "Description": "The [name] has aura 1. Foes in the aura take +1 curse on attacks and saves."
  },
  {
    "Name": "Stone Pantry",
    "Description": "Has evasion while adjacent to an object. In addition, if the [name] ends its turn adjacent to an object, it gains stealth."
  },
  {
    "Name": "Stoneskin",
    "Description": "While adjacent to an object, has resistance."
  },
  {
    "Name": "Street Fighter",
    "Description": "Has resistance while adjacent to two or more foes."
  },
  {
    "Name": "Strength",
    "Description": "This character's abilities have Collide: [fray] damage and foe is dazed. Dazed foes take [D]+[fray] instead."
  },
  {
    "Name": "Sturdy",
    "Description": "When moved or removed and placed by a foe, can only be moved max 1 space a turn."
  },
  {
    "Name": "Stutter",
    "Description": "Once a turn, after a foe takes an action in range 2, this character may teleport 1 and deal 2 damage to an adjacent foe."
  },
  {
    "Name": "Summon",
    "Description": "Natals disappear when reduced to 0 hp and don't cause engagement."
  },
  {
    "Name": "Surreality",
    "Description": "When this character would be defeated, instead becomes intangible until the end of its next turn, then removes itself from the battlefield. It cannot return."
  },
  {
    "Name": "Swarm",
    "Description": "Has resistance to any damage not from area effects or attacks. Does not provide obstruction, but characters treat its space as difficult terrain. (Take 1/2 damage, rounded up)"
  },
  {
    "Name": "Swarm Shroud",
    "Description": "Aura 2. Ranged attacks against this character and allies in the aura gain +1 curse, and foes that start their turn in the aura take 1 piercing damage."
  },
  {
    "Name": "Tactics Aura",
    "Description": "Aura 1. Allies ignore engagement and rampart effects while in the aura, and may dash 1 if they start their turn there."
  },
  {
    "Name": "Terrain Expert",
    "Description": "Ignores movement, damage, and attack penalties from all kinds of terrain."
  },
  {
    "Name": "Terrainwalking",
    "Description": "Ignores movement penalties for height and terrain."
  },
  {
    "Name": "The Old Blood",
    "Description": "Immune to blights."
  },
  {
    "Name": "Time Lock",
    "Description": "After taking damage, this character becomes intangible until the start of the following turn."
  },
  {
    "Name": "True Enrage",
    "Description": "Unstoppable and +1 action while bloodied. (Immune to all statuses. Can't be immobilized, shoved, or teleported by foes)"
  },
  {
    "Name": "Tumbling",
    "Description": "Moving up terrain costs no movement. Can phase through characters and doing so costs a maximum of 1 movement."
  },
  {
    "Name": "Tunnel",
    "Description": "When this character ends its turn, create a pit underneath it."
  },
  {
    "Name": "Two Heads",
    "Description": "Saves at the start and the end of its turn to end conditions or other effects."
  },
  {
    "Name": "Unflattering Bounty Poster",
    "Description": "The [name] starts combat by unveiling an unflattering poster of bounty target, chosen randomly from all player characters. The [name]'s has evasion against that character and their abilities are stronger against them."
  },
  {
    "Name": "Unstable",
    "Description": "When defeated, explodes in a large blast area effect explosion centered on the [name]. Characters inside take piercing fray damage, twice, as an area effect. The [name] is then removed from the battlefield. Create a pit in the area it vacated."
  },
  {
    "Name": "Unstoppable",
    "Description": "Immune to all statuses. Can't be immobilized, shoved, or teleported by foes."
  },
  {
    "Name": "Vantage Point",
    "Description": "Characters mounted on the [name] ignore height disadvantage, have +1 boon on attacks and increase the range of all their abilities with a listed range by +4."
  },
  {
    "Name": "Vengeance",
    "Description": "When bloodied, next attack becomes a critical hit on hit (+[D])."
  },
  {
    "Name": "Venom Blade",
    "Description": "Attacks inflict poisoned, ignore vigor, and deal bonus damage against bloodied characters."
  },
  {
    "Name": "Wayfinding",
    "Description": "Has evasion while inside difficult or dangerous terrain, and ignores the effects of difficult or dangerous terrain."
  },
  {
    "Name": "Zipline Dismount",
    "Description": "Characters mounted on this character can fly 5 and dismount it as free action."
  }
]