[
  {
    "Name": "Acrobatics",
    "Actions": [
      {
        "Name": "Acrobatics",
        "ActionCost": 0,
        "Description": "Dash 2. This action can interrupt and split up other actions or movement."
      }
    ]
  },
  {
    "Name": "Aerial Acrobat",
    "Description": "If an attack misses the [name], they may deal 2 damage to the attacker, then fly 2."
  },
  {
    "Name": "Aetherflesh",
    "Description": "The [name] can teleport 5 instead of taking a standard move."
  },
  {
    "Name": "Aetherskin",
    "Description": "When bloodied, becomes intangible until the end of its next turn."
  },
  {
    "Name": "Aetherwall",
    "Description": "Gains resistance against all abilities from characters that are outside of range 2 from them (Resistance halves damage)."
  },
  {
    "Name": "All Terrain Vehicle",
    "Description": "Unaffected by terrain and height movement penalties."
  },
  {
    "Name": "Amorous Aura",
    "Description": "Aura 2. Characters in the aura reduce all damage from pacified foes to 1."
  },
  {
    "Name": "Amorphous",
    "Description": "Phasing and can share space with other characters. Eharacters that end their turn inside its space take [fray] damage."
  },
  {
    "Name": "Arkentech Bike",
    "Description": "The [name] ignores difficult terrain. It can only move in straight lines, but has phasing. Any character it passes through takes 2 damage, but no more than once a turn."
  },
  {
    "Name": "Armor [X]",
    "Description": "Reduce all damage taken by [X]."
  },
  {
    "Name": "Aura of Alacrity",
    "Description": "Aura 1. Allies in the aura can use the charged effects of abilities even on normal turns."
  },
  {
    "Name": "Aura of Distortion",
    "Description": "Aura 1. Allies inside the aura have evasion and foes are blinded+. Becomes aura 2 when bloodied."
  },
  {
    "Name": "Aura of Dread",
    "Description": "The [name] has aura 2. Foes inside the aura take +1 curse on saves. Any foe that fails a save inside the area must sacrifice 3."
  },
  {
    "Name": "Aura of Freedom",
    "Description": "Aura 1. The [name] and allies in the aura are immune to movement penalties from terrain and elevation."
  },
  {
    "Name": "Aura of Glamour",
    "Description": "Aura 2. Foes outside the aura cannot directly target this character with abilities."
  },
  {
    "Name": "Aura of Immortality",
    "Description": "While the [name] is undefeated, it has Aura 2. Allies without this trait inside cannot be reduced past 1 HP."
  },
  {
    "Name": "Aura of Rot",
    "Description": "Aura 2. Foes that start or end their turn in the aura lose all vigor, then take 2 piercing damage."
  },
  {
    "Name": "Aura of Shielding",
    "Description": "Aura 1. Self and allies in the area have dodge."
  },
  {
    "Name": "Automata",
    "Description": "If the [name] attacks the same character as last turn, it deals bonus damage and gains +1 boon. This effect stacks."
  },
  {
    "Name": "Battle Platform",
    "Description": "Characters can mount or dismount the [name] by spending 1 space of movement, placing them adjacent when dismounting, with the following rules:",
    "ListedItems": [
      { "Description": "Allies can start the battle mounted on the [name]." },
      { "Description": "While mounted, place characters inside a free space in the [name] (so the [name] has space for 4 size 1 characters). They share its space, move when it moves, and have cover. While moving with the [name], characters are unstoppable." },
      { "Description": "Characters hostile to the [name] must pass a save to mount it." },
      { "Description": "Characters mounting it the [name] when it is defeated are placed in any free adjacent space of the [name]'s choice and take 3 damage." }
    ]
  },
  {
    "Name": "Beastmaster",
    "Description": "The [name] starts combat with 3 unique trained beast summons. Place them within range 3.",
    "Summons": [
      {
        "Name": "Trained Beasts",
        "Tags": [ "Size 1", "5 defense", "20 hp" ],
        "SummonEffects": "Unlike other summons, these summons have defense and health and lack intangible (so they can take damage and effects). When defeated, the summons disappear as normal, and they do not cause obstruction or engagement."
      }
    ]
  },
  {
    "Name": "Black Temple Bell",
    "Description": "This [name]'s huge bell is so heavy it can only attack once a round."
  },
  {
    "Name": "Blight Splash",
    "Description": "Attacks deal 1 piercing damage on hit or miss to all foes in range 2 of the target as an area effect."
  },
  {
    "Name": "Blood Hunger",
    "Description": "Deals +2 damage with all abilities against bloodied foes."
  },
  {
    "Name": "Blood Price",
    "Description": "The [name] has Aura 2:",
    "ListedItems": [
      { "Description": "Foes inside the aura that use an ability must sacrifice 2 after the ability resolves." },
      { "Description": "Whenever a character in the area sacrifices, the [name] may grant 2 vigor to itself or any ally in the aura." }
    ]
  },
  {
    "Name": "Blood Rush",
    "Description": "May rush 2 before making any attack. If the attack triggers exceed, may rush 2 again."
  },
  {
    "Name": "Bloodwhetter",
    "Description": "When the [name] is damaged by an ability they may deal 2 damage to an adjacent foe, each time they are damaged."
  },
  {
    "Name": "Boiling Shroud",
    "Description": "While bloodied, the [name] has permanent stealth and gains aura 1. All other characters inside the aura are blinded+ while inside."
  },
  {
    "Name": "Brace",
    "Description": "When adjacent to an object, increase the range of all abilities with a listed range by +4."
  },
  {
    "Name": "Bullheaded",
    "Description": "Has resistance unless suffering from a status."
  },
  {
    "Name": "Burning Wheel",
    "Description": "This [name]'s speed is 15. However, the [name] must move in the same direction for each ability it uses, and can only move in straight lines."
  },
  {
    "Name": "Camouflage",
    "Description": "If this [name] ends its turn adjacent to an object or or inside difficult or dangerous terrain, it gains stealth."
  },
  {
    "Name": "Ceaseless Shrieking",
    "Description": "If no foe is in line of sight of the [name] at the start of its turn, it spends its entire turn shrieking instead of using abilities. All foes take [D]+[fray] piercing damage and are stunned."
  },
  {
    "Name": "Commander's Aura",
    "Description": "Aura 2. Allies in the aura have +1 boon on attacks."
  },
  {
    "Name": "Cornered",
    "Description": "When half its members are remaining or less, this [name] gains +1 action."
  },
  {
    "Name": "Counter",
    "Description": "Each time a foe deals damage to you with an ability, deal 2 damage back."
  },
  {
    "Name": "Cowardly by Nature",
    "Description": "The [name] surrenders and ends the fight if it's the only character left."
  },
  {
    "Name": "Crumbling Body",
    "Description": "Has 12 armor. After any ability damages the hob, permanently reduce its armor by 1 for the rest of combat, even if that damage is reduced to 0. If it's armor is 0, all attacks against it become critical hits on hit."
  },
  {
    "Name": "Crystal Burst",
    "Description": "When the [name] is destroyed or devoured, it shatters, teleporting all characters in range 2 from it 2 spaces and dazing them."
  },
  {
    "Name": "Crystal Dagger",
    "Description": "When the [name] teleports, it may deal 1 damage to a foe in range 3."
  },
  {
    "Name": "Curl Up",
    "Description": "When defeated, this character curls up and becomes a height 1 boulder object."
  },
  {
    "Name": "Dark Hollow",
    "Description": "Deals bonus damage and has evasion unless there's two or more adjacent characters."
  },
  {
    "Name": "Death Shriek",
    "Description": "When defeated, all foes on the battlefield take 2 piercing damage and gain +1 curse on attacks and saves for the rest of the round."
  },
  {
    "Name": "Defiance",
    "Description": "Prevents hit points from being reduced past 1 hp. When this triggers, remove this effect and character becomes immune to all damage for the rest of the current turn."
  },
  {
    "Name": "Deflate",
    "Description": "If the [name] is prevented from flying, it becomes immobile until it can fly again."
  },
  {
    "Name": "Dig",
    "Description": "Can phase through terrain and characters."
  },
  {
    "Name": "Diaga",
    "Actions": [
      {
        "Name": "Diaga",
        "ActionCost": 1,
        "Description": "An ally in range 4 is cured."
      }
    ]
  },
  {
    "Name": "Distorted Soul",
    "Description": "The [name] has the following abilities:",
    "ListedItems": [
      { "Description": "When not bloodied, gain resistance to all abilities from adjacent spaces. However, abilities used against them from range 2 or greater gain pierce and ignore resistance." },
      { "Description": "When bloodied, gain resistance to damage from any ability not from adjacent spaces. However, all abilities used against them from adjacent spaces gain pierce and ignore resistance." }
    ]
  },
  {
    "Name": "Divine Presence",
    "Description": "Immune to stun."
  },
  {
    "Name": "Dodge",
    "Description": "Immune to damage from missed attacks, area effects, and successful saves."
  },
  {
    "Name": "Dweller in Dark",
    "Description": "The [name] has the following abilities:",
    "ListedItems": [
      { "Description": "Immune to blinded." },
      { "Description": "May use its standard move to teleport from the area of any pit to any other pit in range 4." },
      { "Description": "Has resistance while inside a pit." }
    ]
  },
  {
    "Name": "Ear Splitting Song",
    "Description": "The [name] has aura 2. Foes in the aura gain +1 curse on saves and do not save against statuses at the end of their turn. The aura increases to aura 3 when the [name] is bloodied."
  },
  {
    "Name": "Earth Bond",
    "Description": "Resistance when adjacent to an object or inside a pit."
  },
  {
    "Name": "Elite",
    "Description": "Takes 2 turns.",
    "EncounterBudget": 2
  },
  {
    "Name": "Empty Husk",
    "Description": "This character becomes a height 1 object when defeated instead of a character, and cannot be returned to the battlefield."
  },
  {
    "Name": "Enrage",
    "Description": "+1 action when bloodied."
  },
  {
    "Name": "Entrenched",
    "Description": "Unstoppable while in a pit."
  },
  {
    "Name": "Ethereal (Resistance)",
    "DisplayName": "Ethereal",
    "Description": "Phasing, and has resistance unless adjacent to a foe."
  },
  {
    "Name": "Ethereal (Evasion)",
    "DisplayName": "Ethereal",
    "Description": "Phasing, and has evasion unless adjacent to a foe."
  },
  {
    "Name": "Explosive Demise",
    "Description": "When defeated, explodes in a small blast area effect centered on it. Characters inside are shoved 1 away from the origin space and must save or take [D]+[fray], or [fray] on a successful save."
  },
  {
    "Name": "Eyeless",
    "Description": "Immune to blinded."
  },
  {
    "Name": "Eyes Within Eyes",
    "Description": "Immune to blinded. Simply grows more eyes."
  },
  {
    "Name": "Flip Over",
    "Description": "When taking damage more than its armor total, loses all armor, becomes stunned, and all attacks against it deal bonus damage. These effects last until the end of its next turn."
  },
  {
    "Name": "Flying",
    "Description": "Ignores terrain damage and movement penalties, height movement penalties, obstruction, and engagement."
  },
  {
    "Name": "Forced March",
    "Description": "At the start of their turn, the [name] and all allies may dash 1 in the same direction."
  },
  {
    "Name": "Gran Diaga",
    "Description": "Aura 2. At the start of the [name]'s turn, all allies in the aura gain vigor 3."
  },
  {
    "Name": "Greenwalker",
    "Description": "Immune to difficult terrain."
  },
  {
    "Name": "Guard",
    "Description": "Has Rampart, Reduce all damage to self and allies in orthogonal spaces by 2, as if by armor."
  },
  {
    "Name": "Harden",
    "Description": "The [name] hardens over time, and increases all damage it deals by an amount equal to twice the round number. At the end of round 6, it finally petrifies and is defeated."
  },
  {
    "Name": "Heavy Arkentech Armor",
    "Description": "The [name] is fitted with heavy power armor that is only strong from the front, with the following effects:",
    "ListedItems": [
      { "Description": "They cannot dash, fly, or teleport." },
      { "Description": "They can be used for cover by allies as if a height 1 object." },
      { "Description": "At the end of the [name]'s turn, decide which character they are facing towards. They become resistant to all damage from that character and unstoppable against any of their abilities. It can instead choose to grant these benefits to an adjacent ally. It must choose a different character each turn from the last." }
    ]
  },
  {
    "Name": "Heavy Armor",
    "Description": "Resistant to abilities used from adjacent spaces."
  },
  {
    "Name": "Heavy Caliber",
    "Description": "The [name]'s abilities have Collide: [fray] damage and foe is slashed."
  },
  {
    "Name": "Hold the Line",
    "Description": "If the [name] ends any turn without attacking, they gain Sturdy and Vigilance +1."
  },
  {
    "Name": "Hovering",
    "Description": "Immune to rampart."
  },
  {
    "Name": "Hunting Horror",
    "Description": "The [name] has evasion unless there are two or more adjacent foes."
  },
  {
    "Name": "Immobile",
    "Description": "Can't move, be moved, or be removed from the battlefield in any way."
  },
  {
    "Name": "Immortal Disregard",
    "Description": "Attacks never miss the [name] (turn any miss into a hit).",
    "Defense": 0
  },
  {
    "Name": "Immovable Object",
    "Description": "Cannot be shoved, teleported, or removed from the battlefield."
  },
  {
    "Name": "Implode",
    "Description": "At the start of round 4, this [name] explodes, destroying the [name] and dealing [D]+[fray] piercing damage as an area effect to all foes on the battlefield."
  },
  {
    "Name": "Insulated",
    "Description": "Immune to damage from terrain and terrain effects."
  },
  {
    "Name": "Iron Scale",
    "Description": "Resistant to abilities used from adjacent spaces. Loses this trait when bloodied."
  },
  {
    "Name": "Juggernaut",
    "Actions": [
      {
        "Name": "Juggernaut",
        "RoundAction": true,
        "Description": "At the start of the round, this character may clear a status or mark."
      }
    ]
  },
  {
    "Name": "Latch",
    "Description": "Starts combat sharing the same space as another ally the same size or larger. While latched on, can't move, but instead moves with its host. Being moved out of its host's space end this effect. If the [name] would be shoved, teleported, or removed from the battlefield, it can pass a save to avoid the effect and become immune to these effects until the end of the current turn. Can latch on to a new adjacent allied character with 1 action or its standard move ability."
  },
  {
    "Name": "Lead Astray",
    "Description": "Aura 2. The [name] may teleport any character that ends their turn in the aura 2 spaces in any direction."
  },
  {
    "Name": "Leap",
    "Description": "This [name] ignores height movement penalties. When it ends any movement on a lower elevation than it started, it gains flying for the duration of that movement."
  },
  {
    "Name": "Legend",
    "Description": "Takes 1 turn for each player character.",
    "EncounterBudget": -1.0
  },
  {
    "Name": "Lesser Mortal Mockery",
    "Description": "At the start of its turn, the [name] transforms its physical form into a brief mockery of the closest foe. The effects depend on the foe's class. If multiple foes are equidistant, it can choose.",
    "ListedItems": [
      { "Name": "Stalwart", "Description": "The [name] becomes sturdy until the start of its next turn." },
      { "Name": "Vagabond", "Description": "The [name] gains evasion until the start of its next turn." },
      { "Name": "Mendicant", "Description": "The [name] may cure itself." },
      { "Name": "Wright", "Description": "The [name] creates a height 1 aethershard object in range 3, then may teleport on top of it." }
    ]
  },
  {
    "Name": "Lick Knife",
    "Description": "The [name]'s abilities all have",
    "CustomComponents": [
      {
        "Name": "Slay",
        "Description": "gain +1 action. This trait can only trigger once a turn."
      }
    ]
  },
  {
    "Name": "Living Root",
    "Description": "When defeated, becomes a height 2 object."
  },
  {
    "Name": "Lone Wolf",
    "Description": "When ending their turn with no foes or allies in range 2, gains stealth."
  },
  {
    "Name": "Long Legs",
    "Description": "Ignores all obstruction and terrain movement penalties."
  },
  {
    "Name": "Low Profile",
    "Description": "Has evasion against ranged attacks."
  },
  {
    "Name": "Lucky Feather",
    "Description": "When taking damage that would reduce the hob to 0 hp, gamble. On a 3+, become immune to all damage from the triggering ability. True strike bypasses this effect."
  },
  {
    "Name": "Lumbering",
    "Description": "Cannot dash. Only takes slow turns.",
    "DashMultiplier": 0
  },
  {
    "Name": "Lurker in the Dark",
    "Description": "Has stealth+ if no other characters are in range 2."
  },
  {
    "Name": "Martyrdom",
    "Description": "When defeated, cures all allies in range 2."
  },
  {
    "Name": "Master of Gun",
    "Description": "Has counter against all abilities used from a range of 3 or greater. Damage from counter ignores cover."
  },
  {
    "Name": "Master of Strategy",
    "Description": "Before combat starts, may move every character to any space up to 2 spaces in any direction from their starting location."
  },
  {
    "Name": "Master of the Underway",
    "Description": "The [name] gains stealth if they start or end their turn in a pit and can use 2 spaces of movement to teleport from any pit space to any other free pit space."
  },
  {
    "Name": "Mimicry",
    "Description": "In any battle with the [name], place 5 decoys on the battlefield at the start of the battle. Unlike other summons, they lack the intangible trait and can be destroyed.",
    "Summons": [
      {
        "Name": "Decoy",
        "Tags": [ "Size 1 summon", "immobile", "1 hp", "1 defense" ],
        "SummonEffects": "The GM secretly picks one of the decoys that is actually the [name]. When that decoy is targeted by an ability, before the ability is made, replace the decoy with the [name] and retarget the attack to the [name]. This reveals the [name]."
      }
    ]
  },
  {
    "Name": "Mist Form",
    "Description": "The [name] is a character and also a space of dangerous and difficult terrain. Characters can share space with it, and it has resistance against any character inside of its space."
  },
  {
    "Name": "Mob",
    "Description": "This character doesn't trigger slay effects, and is removed when defeated."
  },
  {
    "Name": "Monster Riding",
    "Description": "The [name] starts combat riding a trained monster, and can also mount it as an action or by spending its standard move. While riding, the [name] shares space with the monster and moves when it moves, becoming unstoppable while moving this way. If the two are separated, this effect ends until the monster is remounted.",
    "Summons": {
      "Name": "Tame Monster",
      "Tags": [ "Size 1 summon"],
      "SummonActions": "During the [name]'s turn, can dash 4, then either shove a character 1 space or deal 2 damage to them."
    }
  },
  {
    "Name": "Mud Body",
    "Description": "Has resistance while inside difficult or dangerous terrain, or pits. If outside those terrain areas, takes bonus damage and +1 curse on attacks and saves."
  },
  {
    "Name": "Nimble",
    "Description": "Has evasion unless suffering from a status."
  },
  {
    "Name": "Noxious Censer",
    "Description": "Aura 2. Characters in the aura have cover against abilities used from the outside, and foes in the aura get +1 curse on attacks."
  },
  {
    "Name": "Overwhelming Stench",
    "Description": "Aura 1. Attackers in the aura gain +1 curse on attacks, and characters in aura that end their turn there are dazed. Dazed characters take 4 damage instead."
  },
  {
    "Name": "Painwrack",
    "Description": "Characters that collide with the [name] take 4 damage, but no more than once a round."
  },
  {
    "Name": "Phase Slip",
    "Description": "After being damaged for the first time on any turn, become intangible until the start of the following turn."
  },
  {
    "Name": "Phasing",
    "Description": "Can ignore obstruction and pass through, but not end your turn in, terrain, objects, or characters."
  },
  {
    "Name": "Pixie Dust",
    "Description": "Aura 2. Allies that start their turn in the aura gain flying until the end of their turn."
  },
  {
    "Name": "Power From Pain",
    "Description": "Has counter, and grants counter to all adjacent allies. Each time counter triggers on self or adjacent allies, this [name] gains 1 vigor."
  },
  {
    "Name": "Primal Strength",
    "Description": "All the [name]'s abilities have Collide: foes are is weakened. Weakened foes take 2 damage on collide instead, and the [name] gains 2 vigor."
  },
  {
    "Name": "Quicksilver",
    "Description": "The [name]'s abilities leave pools of quicksilver on the ground. Quicksilver is a 1 space difficult terrain terrain effect, which the [name] ignores."
  },
  {
    "Name": "Rampart",
    "Description": "Foes cannot enter or exit a space affected by a rampart effect by dashing, flying, or teleporting."
  },
  {
    "Name": "Rancor",
    "Description": "Foes that end their turn adjacent to the [name] take 3 damage and are slashed."
  },
  {
    "Name": "Regeneration",
    "Description": "If bloodied, gain 4 vigor at the end of your turn."
  },
  {
    "Name": "Ruin Lord",
    "Description": "Can stack up to two marks on characters."
  },
  {
    "Name": "Rune-Glamor",
    "Description": "May be size 1 or size 2 (choose at the start of combat)."
  },
  {
    "Name": "Saddle Up",
    "Description": "Allies can mount or dismount the [name] by spending 1 space of movement, placing them adjacent when dismounting, with the following rules:",
    "ListedItems": [
      { "Description": "Allies can start the battle mounted." },
      { "Description": "While mounted, place characters inside a free space on the [name]. They share its space, move when it moves, and have cover. While moving with the [name], characters are unstoppable." },
      { "Description": "The rider benefits from the [name]'s phasing." },
      { "Description": "Characters mounting the [name] when it is defeated are placed in any free adjacent space of the [name]'s choice and take 3 damage." }
    ]
  },
  {
    "Name": "Salty",
    "Description": "When the Sailor sacrifices any amount, they gain 3 vigor after the triggering ability resolves."
  },
  {
    "Name": "Shaggy Mass",
    "Description": "The [name] blocks line of sight and provides cover as though it was a height 3 object."
  },
  {
    "Name": "Shed Flesh",
    "Description": "After taking damage that bloodies it, becomes intangible until the start of its next turn as it wriggles out of its flesh. For the rest of combat, gains phasing and flying."
  },
  {
    "Name": "Size [X]",
    "Description": "This character takes up a [X] by [X] area of spaces."
  },
  {
    "Name": "Skirmisher",
    "Description": "Can move diagonally, and dash moves full speed.",
    "DashMultiplier": 1
  },
  {
    "Name": "Slam",
    "Description": "When a character collides from the [name]'s moves, they are slashed. Slashed characters take [fray] damage instead."
  },
  {
    "Name": "Slip",
    "Description": "Movement ignores rampart, interrupts, and vigilance."
  },
  {
    "Name": "Slippery",
    "Description": "Has evasion while bloodied."
  },
  {
    "Name": "Sneak",
    "Description": "While in stealth, has evasion and phasing."
  },
  {
    "Name": "Sneak Attack",
    "Description": "Attacks that break Stealth deal bonus damage and can critical hit (+[D])."
  },
  {
    "Name": "Soul Mass",
    "Description": "Can share space with other characters. Foes treat the space as difficult terrain, are slashed+ while inside, and have cover from the outside, but are otherwise targetable normally. Any foes that start their turn inside its space take [fray] damage. Foes that attempt to leave this character's space by any means on their turn must save or become unable to exit it until the end of the current turn."
  },
  {
    "Name": "Spindly Limbs",
    "Description": "Ignores engagement from other character, and spends no additional movement moving up or down terrain."
  },
  {
    "Name": "Spiritfeed",
    "Description": "All this character's abilities gain slay: gain +1 action."
  },
  {
    "Name": "Split",
    "Description": "At the start of any turn that it is bloodied, the [name] creates an [name] duplicate in an adjacent space. The duplicate is a new character that is an exact copy of the [name] at the time this split happens, except without this trait. It may act starting next round. The [name] can create multiple copies of itself this way in a fight."
  },
  {
    "Name": "Stench",
    "Description": "Aura 1. Foes in the aura take +1 curse on attacks and saves."
  },
  {
    "Name": "Stone Pantry",
    "Description": "Has evasion while adjacent to an object. In addition, if the [name] ends its turn adjacent to an object, it gains stealth."
  },
  {
    "Name": "Stoneskin",
    "Description": "While adjacent to an object, has resistance."
  },
  {
    "Name": "Street Fighter",
    "Description": "Has resistance while adjacent to two or more foes."
  },
  {
    "Name": "Sturdy",
    "Description": "When moved or removed and placed by a foe, can only be moved max 1 space a turn."
  },
  {
    "Name": "Surreality",
    "Description": "When this character would be defeated, instead becomes intangible until the end of its next turn, then removes itself from the battlefield. It cannot return."
  },
  {
    "Name": "Swarm Detonation",
    "Description": "When any [name] is defeated, it deals 2 piercing damage to all adjacent foes."
  },
  {
    "Name": "Swarm Shroud",
    "Description": "Aura 2. Attacks against the [name] and allies in the aura gain +1 curse, and foes that start their turn in the area take 1 piercing damage."
  },
  {
    "Name": "Tactics Aura",
    "Description": "Aura 1. Allies ignore engagement and rampart effects while in the aura, and may dash 1 if they start their turn there."
  },
  {
    "Name": "Thicket Dance",
    "Description": "At the start of its turn, before any delay effects activate, the [name] and all characters in range 2 teleport 1 space in a direction of the [name]'s choice."
  },
  {
    "Name": "Time Lock",
    "Description": "After any ability resolves that damages the [name], it becomes intangible until the start of the following turn, and may teleport 2."
  },
  {
    "Name": "Toxic Revenge",
    "CustomComponents": [
      {
        "Name": "Area Effect",
        "Description": "Area Effect: When defeated, explodes with venom, inflicting [D]+[fray] damage as a burst 1 (self) area effect."
      }
    ]
  },
  {
    "Name": "True Enrage",
    "Description": "+1 action and unstoppable while bloodied."
  },
  {
    "Name": "Tumbling",
    "Description": "Moving up terrain costs no movement. Can phase through characters and doing so costs a maximum of 1 movement."
  },
  {
    "Name": "Tunnel",
    "Description": "When the [name] ends its turn, create a pit underneath it."
  },
  {
    "Name": "Two Heads",
    "Description": "Saves at the start and the end of its turn to end conditions or other effects."
  },
  {
    "Name": "Unflattering Bounty Poster",
    "Description": "The [name] starts combat by unveiling an unflattering poster of bounty target, chosen randomly from all player characters. The [name]'s has evasion against that character and their abilities are stronger against them."
  },
  {
    "Name": "Unstable",
    "Description": "When defeated, explodes in a large blast area effect explosion centered on the [name]. Characters inside take piercing fray damage, twice, as an area effect. The [name] is then removed from the battlefield. Create a pit in the area it vacated."
  },
  {
    "Name": "Vantage Point",
    "Description": "Characters mounted on the [name] ignore height disadvantage, have +1 boon on attacks and increase the range of all their abilities with a listed range by +4."
  },
  {
    "Name": "Walking Dead",
    "Description": "Disintegrates and is defeated if all other foes are defeated."
  },
  {
    "Name": "Wayfinding",
    "Description": "Has evasion while inside difficult or dangerous terrain, and ignores the effects of difficult or dangerous terrain."
  },
  {
    "Name": "Whirlgang",
    "Description": "At the start of its turn, the [name] and all allies in range 2 may fly 1 in the same direction."
  },
  {
    "Name": "Zipline Dismount",
    "Description": "Characters mounted on the [name] can fly 3 and dismount it as free action ability."
  }
]