[
  {
    "Name": "Static Charge", 
    "Description": "At the start of combat, roll 1d6 for each foe (or flip a coin). On tails, or 1-3, the foe gains a negative charge. On a 4+, the foe gains a positive charge. These charges are ongoing effects:",
    "ListedItems": [
      { 
        "Description": "If a character ends their turn adjacent to a character with the same charge as them, both characters are each shoved 2 away from each other."
      },
      {
        "Description": "If a character ends their turn within range 2 of a character with an opposite charge, they are shoved towards that character until adjacent and become stuck to them. While stuck:",
        "ListedItems": [
          { "Description": "If either character attempts to break adjacency, or is moved by another character in a way that would break adjacency, they must first save." },
          { "Description": "On a successful save, they can move or be moved normally." },
          { "Description": "On a failed save, they become unable to exit adjacency with the character they are stuck to for any reason for the rest of the current turn (they can still move normally, as long as they don't break adjacency)." },
          { "Description": "Being shoved by like polarity (see above) bypasses this save and always works." }
        ]
      }
    ]
  },
  {
    "Name": "Call Steed", 
    "Description": "The Rider gains a massive Titansteed, granting it the following benefits:",
    "ListedItems": [
      { "Description": "Increase the Rider's speed to 5." },
      { "Description": "The Rider gains flying." },
      { "Description": "The Rider may break up any of its movement with actions." }
    ]
  },
  

  {
    "Name": "Quicksilver", 
    "Description": "Certain abilities from the Keeper drop a pool of Quicksilver. Quicksilver is difficult terrain, which the Keeper ignores. Characters that end their turn in quicksilver quench their embers, getting rid of all of them, but also consuming the quicksilver space."
  },
  {
    "Name": "Great Ignition", 
    "Description": "At the end of the round, all embers that haven't been picked up explode, destroying them and dealing 1 divine damage to all foes as an effect."
  },
  {
    "Name": "Blade of Creation", 
    "Description": "The Keeper gains aura 1. When the Keeper ends its turn, it draws in any quicksilver in the aura, destroying it. Track the number of pools it picks up with a power die. At the end the round, it makes the following attack:",
    "ExtraActions": {
      "Name": "Blade of Creation",
      "RoundAction": true,
      "Tags": [ "attack", "range 4", "line 10", "true strike", "divine" ],
      "Hit": "5 damage, once for each quicksilver pool picked up this round. ",
      "Miss": "2 damage, once for each pool picked up this round.",
      "AreaEffect": "2 damage, once for each pool picked up this round."
    }
  },
  

  {
    "Name": "Time Heals All", 
    "Description": "As a side effect of time distortion, after this fight, all characters heal all wounds."
  },
  {
    "Name": "Tides of Time", 
    "Description": "Many of the Warden's abilities create a Time effect. Time effects have a Time Die, which is a d6. The die is either rolled or starts at a fixed number. At the end of any turn, including the Warden's turns, tick all time dice down by 1. When the die is at 1 and would tick down to 0, remove the die and immediately trigger the Time Effect. Time dice and their current number are visible to all characters."
  },
  {
    "Name": "Unmoor", 
    "Description": "At the start combat, the Warden chooses a character, which gains aura 2 for the rest of the fight. When that character ends their turn with a time effect in the aura, they may choose to re-roll any or all of those time effects. A character can willingly pass this aura to an adjacent ally as a free action on their turn, and it affects a new character (chosen by the Warden) if the currently affected character is defeated."
  }
]