[
  {
    "Name": "Divine Ambrosia",
    "Description": "The Aegis's mere presence envelops the battlefield in a drunken haze. At the start of combat, give a d6 to all characters, representing their level of intoxication. Certain abilities Intoxicate foes, ticking the die up by 1. If a die would become 6, a character can't take any more. The must save or sacrifice 25% of their maximum hp and spend their entire next turn incapacitated and throwing up, resetting the die to 1. On a successful save, lower the die by 2 and take no other negative effects."
  },
  {
    "Name": "Sober Up",
    "Description": ": A character can sober up at the start of their turn by rolling 1d6, taking one of the following effects and reducing their intoxication by 3, to a minimum of 1. Effects with a duration last until the start of the character's next turn.",
    "Rolls": [
      {
        "Values": 1,
        "Name": "Nonstop Singing",
        "Description": "The character gains aura 1. Allies in the aura are weakened++."
      },
      {
        "Values": 2,
        "Name": "Stagger",
        "Description": "The Aesi shoves the character 2.",
        "CustomComponents": {
          "Name": "Collide",
          "Description": "Foe takes 5 damage."
        }
      },
      {
        "Values": 3,
        "Name": "Stand and Blink",
        "Description": "The character becomes immobile."
      },
      {
        "Values": 4,
        "Name": "Clingy",
        "Description": "The character can only use non-basic abilities if adjacent to an ally."
      },
      {
        "Values": 5,
        "Name": "Take a Nap",
        "Description": "The character is weakened. If already weakened, they are stunned."
      },
      {
        "Values": 6,
        "Description": "No extra effects."
      }
    ]
  },

  
  {
    "Name": "Immortal Thievery",
    "Description": "Some of the Aesi's abilities have the thievery tag. When an ability with this tag is used, the Aesi creates a memory as a summon in any free space within range 4 of that character.",
    "Summons": {
      "Name": "Memory",
      "Tags": [ "Size 1", "intangible" ],
      "SummonEffects": "Can share space with all characters. Characters can end any thievery effects on them by passing over and picking up a memory (any memory will do). This consumes the memory, removing it."
    }
  }
]