[
  {
    "Name": "The Idol",
    "Description": "The Idol is a 2x2 height 3 immobile object on the map that is not a character and is immune to all damage and effects except from its own worshippers. It cannot be removed for any reason."
  },
  {
    "Name": "Aura of Sacrifice",
    "Description": "Damage deal to characters adjacent to the idol becomes divine."
  },
  {
    "Name": "Worshippers",
    "Description": "At the start of combat and the start of every round, the Idol creates worshippers. It always has a mob of lesser clots, and a number of total worshippers (including the mob) equal to twice the number of players. Worshippers use the idol's damage die (d8) and fray damage (3).",
    "ListedItems": [
      { "Description": "Worshippers are new characters that only act on the idol's turn. When created, they can be created in range 3 of the idol or any of its terrain effects." },
      { "Description": "On each of the Idol's turns, it chooses a different worshipper to act, including the clot mob. A worshipper may use their standard move, dash, or use the abilities in their profile." },
      { "Description": "Worshippers can act again in a round, but only when all worshippers have acted at least once." },
      { "Description": "When defeated, worshippers other than Clots deal damage to the idol equal to their maximum hp. This is only way to damage the idol." }
    ],
    "Summons": [
      {
        "Name": "Lesser Clot",
        "Class": "Mob",
        "Tags": [ "5 defense", "spd 4" ],
        "Traits": [ "Mob", "Filth Body" ],
        "Actions": {
          "Name": "Fetid Grasp",
          "ActionCost": 2,
          "Tags": [ "attack", "range 2" ],
          "Hit": "[D]+[fray].",
          "Miss": "[fray].",
          "Effects": [
            "Shove foe 1 space towards the acting clot.",
            "All other clots may shove a foe in range 2 one space towards them, then all foes that were shoved this way take 2 damage."
          ]
        }
      },
      {
        "Name": "1-2: Cultist",
        "Class": "Skirmisher",
        "Tags": [ "15 hp", "10 defense", "spd 4" ],
        "Traits": [ "Dodge", "Skirmisher" ],
        "Actions": [
          {
            "Name": "Blood Spiller",
            "ActionCost": 1,
            "Tags": [ "attack" ],
            "Hit": "[D]+[fray].",
            "Miss": "[fray].",
            "Effects": [
              "Deals [fray] damage again to bloodied characters, or [fray] damage twice again to characters at 25% hp or lower.",
              "Dash 2 before or after the attack."
            ]
          },
          {
            "Name": "Drag Hook",
            "ActionCost": 1,
            "Tags": [ "unerring" ],
            "Effects": "A character in range 5 takes 2 damage, is dazed and shoved 1 in any direction. Bloodied characters are shoved 3 instead."
          }
        ]
      },
      {
        "Name": "3-4: Vile Darter",
        "Class": "Artillery",
        "Tags": [ "15 hp", "8 defense", "spd 4" ],
        "Traits": [ "Aetherwall" ],
        "Actions": {
          "Name": "Blowdart",
          "ActionCost": 2,
          "Tags": [ "attack", "range 8" ],
          "Hit": "2[D]+[fray].",
          "Miss": "[fray].",
          "Effects": [
            "Deals bonus damage to bloodied foes.",
            "If foe is standing adjacent to the idol or in difficult or dangerous terrain, they are shattered."
          ]
        }
      },
      {
        "Name": "5-6: Giant Insect",
        "Class": "Heavy",
        "Tags": [ "20 hp", "6 defense", "spd 4" ],
        "Traits": [ "Guard" ],
        "Actions": [
          {
            "Name": "Crush",
            "ActionCost": 1,
            "Tags": [ "attack", "true strike" ],
            "Hit": "[D]+[fray].",
            "Miss": "[fray].",
            "Effects": "Shove 1, or shove 3 if foe is bloodied.",
            "Collide": "Character is weakened."
          },
          {
            "Name": "Pound",
            "ActionCost": 1,
            "Tags": [ "medium blast" ],
            "Description": "Dash 2 spaces.",
            "AreaEffect": "Characters take 2 damage and are shoved 1."
          }
        ]
      }
    ]
  },
  {
    "Name": "Filth Body",
    "Description": "Lesser Clots are immune to all damage while inside difficult or dangerous terrain or adjacent to the Idol."
  },
  {
    "Name": "Worshippers Phase 2",
    "DisplayName": "Worshippers",
    "Description": "As phase I, but once a round, may act with an extra worshipper during a turn (so two worshippers act at once, in any order)."
  },
  {
    "Name": "Manifestations Phase 2",
    "DisplayName": "Manifestations",
    "Description": "As phase I, but in addition to its regular manifestations, creates the following:",
    "ListedItems": [
      {
        "Name": "Pit of Sacrifice",
        "Description": "Create a pit. Damage dealt to characters in the pit becomes divine."
      }
    ]
  },


  {
    "Name": "Worm and Rider",
    "Description": "This fight is made of two characters, the worm and the rider. Each is separately targetable, has its own hp, and tracks statuses and effects separately. When this legend acts, it alternates turns between the Worm and Rider if possible (if both of them are active and on the battlefield - the Rider might not be from Hurian Dive).",
    "ListedItems": [
      { "Description": "The Worm is size 2 and sturdy." },
      { "Description": "The Rider is size 1 and has the skirmisher and dodge traits." }
    ]
  },
  {
    "Name": "Wormspore Bond",
    "Description": "If the Worm or Rider is defeated, at the end of the round, if their partner is active, undefeated, and within range 4, they return to 25% maximum hp and return from being defeated. The legend is only fully defeated if both worm and rider are defeated in the same round."
  },
  {
    "Name": "Deep Riders",
    "Description": "Both these characters ignore movement and height penalties from pits. Attacks against characters in pits deal bonus damage and can critical hit (+[D])."
  },
  {
    "Name": "Worm Riding",
    "Description": "When the Worm enters or exits any space within range 2 of the Rider, the rider can hitch along. Remove the Rider from play as it hops on the worm. At the end of the current turn, place the Rider adjacent to the worm."
  },
  {
    "Name": "Law of the Worm",
    "Description": "This legend gains +1 action. The extra action must be used to take a Rider action on the Worm's turn, or vice-versa, though the per-turn attack limit must still be obeyed."
  }
]